================================================================================
Simple command with args
================================================================================

test foo

--------------------------------------------------------------------------------

(script_file
  (command
    (command_name)
    (arguments
      (command_argument))))

================================================================================
Simple command with bang
================================================================================

test!

--------------------------------------------------------------------------------

(script_file
  (command
    (command_name)
    (bang)))

================================================================================
Simple command with weird arguments
================================================================================

test a.b.c a:foobar

--------------------------------------------------------------------------------

(script_file
  (command
    (command_name)
    (arguments
      (command_argument)
      (command_argument))))

================================================================================
Simple command without args
================================================================================

test

--------------------------------------------------------------------------------

(script_file
  (command
    (command_name)))

================================================================================
Simple command multiline
================================================================================

test foo
	\ foo

--------------------------------------------------------------------------------

(script_file
  (command
    (command_name)
    (arguments
      (command_argument)
      (command_argument))))

================================================================================
Multiple commands pipe
================================================================================

test | test

--------------------------------------------------------------------------------

(script_file
  (command
    (command_name))
  (command
    (command_name)))

================================================================================
Throw statement
================================================================================

throw abc
thr abc

--------------------------------------------------------------------------------

(script_file
  (throw_statement
    (identifier))
  (throw_statement
    (identifier)))

================================================================================
Execute statement
================================================================================

execute "abd"
exe "foobar" .. "bcd"
exe "foobar" .. "bcd" foor

--------------------------------------------------------------------------------

(script_file
  (execute_statement
    (string_literal))
  (execute_statement
    (binary_operation
      (string_literal)
      (string_literal)))
  (execute_statement
    (binary_operation
      (string_literal)
      (string_literal))
    (identifier)))

================================================================================
Execute in if
================================================================================

if v:true
  exe foo
endif

--------------------------------------------------------------------------------

(script_file
  (if_statement
    (scoped_identifier
      (scope)
      (identifier))
    (body
      (execute_statement
        (identifier)))))
